Repository: albanobattistella/gosa-plugin-schoolmanager
Catalog: locale/*.po
Languages: it

source: Delimiter for column fields in CSV file:
it: Delimitatore per i campi colonna nel file CSV:

source: Note:
it: Nota:

source: The following filters are automatically applied on CSV file import...
it: I seguenti filtri vengono automaticamente applicati all'importazione del file CSV ...

source: Auto-detection of charset encoding (everything gets converted internally to UTF-8)
it: Rilevamento automatico della codifica charset (tutto viene convertito internamente in UTF-8)

source: Single and double quotes next to the field delimiters get removed
it: Le virgolette singole e doppie accanto ai delimitatori di campo vengono rimosse

source: MS-DOS / Unix line ending style gets recognized automatically and processed accordingly
it: Lo stile finale della linea MS-DOS / Unix viene riconosciuto automaticamente ed elaborato di conseguenza

source: STEP %1: Configure import options
it: FASE% 1: Configurare opzioni di importazione

source: School Manager's import functionality is very flexible and can be adapted to your needs. Please configure options of this import below.
it: La funzionalità di importazione di School Manager è molto flessibile e può essere adattata alle tue esigenze. Si prega di configurare le opzioni di questa importazione di seguito.

source: Configure import options
it: Configura le opzioni di importazione

source: Please choose from the available GOsa2 user object templates what account templates to use for students and for their parents.
it: Scegli tra i modelli di oggetti utente GOsa2 disponibili quali modelli di account utilizzare per gli studenti e per i loro genitori.

source: Select template for student accounts
it: Seleziona un modello per gli account degli studenti

source: Select template for parent accounts
it: Seleziona il modello per gli account principali

source: Create a sub-OU for each class and place student accounts belonging to the same class into their corresponding class OU?
it: Crea una sub-OU per ogni classe e metti gli account degli studenti appartenenti alla stessa classe nella loro OU di classe corrispondente?

source: (tick this check box, if yes)
it: (spunta questa casella, se sì)

source: If CSV data does not contain a user ID (uid) column, use the mail address as user ID instead?
it: Se i dati CSV non contengono una colonna ID utente (uid), utilizzare invece l'indirizzo mail come ID utente?

source: Please choose from the available GOsa2 user object templates what account template to use for teachers.
it: Scegli tra i modelli di oggetti utente GOsa2 disponibili e quale modello di account utilizzare per gli insegnanti.

source: Select template for teacher accounts
it: Seleziona il modello per gli account degli insegnanti

source: Make all teachers teaching courses in a class members of that class group?
it: Rendi tutti gli insegnanti che insegnano i corsi in una classe membri di quel gruppo di classe?

source: Please choose from the available GOsa2 user object templates what account templates to use for students.
it: Scegli tra i modelli di oggetti utente GOsa2 disponibili e quali modelli di account utilizzare per gli studenti.

source: During this import we will probably create several non-primary groups (for classes, courses). Where in the LDAP tree shall these new group objects be created?
it: Durante questa importazione creeremo probabilmente diversi gruppi non primari (per classi, corsi). Dove nell'albero LDAP devono essere creati questi nuovi oggetti di gruppo?

source: Select OU for new groups:
it: Seleziona OU per nuovi gruppi:

source: And what mail domain should these new groups be in?
it: E quale dominio di posta elettronica dovrebbero essere questi nuovi gruppi?

source: Mail domain for new groups:
it: Dominio di posta per nuovi gruppi:

source: Please select the attributes which will identify users from the CSV file as existing users
it: Seleziona gli attributi che identificheranno gli utenti dal file CSV come utenti esistenti

source: Given Name
it: Nome di Battesimo

source: Surname
it: Cognome

source: STEP %1: Check CSV data and assign to LDAP attributes
it: FASE 1%: Controllare i dati CSV e assegnare agli attributi LDAP

source: Please assign the offered (LDAP) attributes to the CSV data columns. Note that the CSV file has been rotated 90DEGREES counter-clockwise for better readability.
it: Assegna gli attributi offerti (LDAP) alle colonne di dati CSV. Notare che il file CSV è stato ruotato di 90 GRADI in senso antiorario per una migliore leggibilità.

source: Check CSV data
it: Controlla i dati CSV

source: STEP %1: Review user account objects before LDAP import
it: FASE 1%: oggetti Recensione account utente prima di importazione LDAP

source: STEP %1 (LDAP import status): User account objects have been imported into LDAP
it: FASE 1% (LDAP Stato di importazione): oggetti account utente sono stati importati in LDAP

source: STEP %1 Review group memberships before LDAP update
it: FASE %1 Rivedi le appartenenze ai gruppi prima dell'aggiornamento LDAP

source: STEP %1 (LDAP import status): Accounts' group memberships have been updated in LDAP
it: FASE 1% (LDAP Stato di importazione): Appartenenza al gruppo Conti sono stati aggiornati in LDAP

source: User account: %1, %2
it: Account utente: %1, %2

source: New user account: %1, %2
it: Nuovo account utente: %1, %2

source: Account group for %1, %2
it: Gruppo di account per %1, %2

source: <keep>
it: <Tenere>

source: Groups
it: Gruppi

source: Group membership actions
it: Azioni di appartenenza al gruppo

source: New associated account: %1, %2
it: Nuovo account associato: %1, %2

source: Insufficient account data: %1, %2
it: Dati dell'account insufficienti: %1, %2

source: Associated account: %1, %2
it: Account associato: %1, %2

source: STEP %1: Review group objects before LDAP import
it: FASE %1: Esamina gli oggetti del gruppo prima dell'importazione LDAP

source: STEP %1 (LDAP import status): Group objects have been imported into LDAP
it: FASE 1% (LDAP Stato di importazione): oggetti di gruppo sono stati importati in LDAP

source: Standard (POSIX) groups
it: Gruppi standard (POSIX)

source: Object groups
it: Gruppi di oggetti

source: STEP %1: LDAP import completed. Statistical overview of all import actions.
it: FASE 1%: import LDAP completato. Panoramica statistica di tutte le azioni di importazione.

source: All entries have been written to the LDAP database successfully.
it: Tutte le voci sono state scritte correttamente nel database LDAP.

source: There has been at least one error during the import of your data.
it: C'è stato almeno un errore durante l'importazione dei tuoi dati.

source: Here is the status report for the import:
it: Ecco il rapporto sullo stato per l'importazione:

source: Continue here, when ready
it: Continua qui, quando sei pronto

source: Set import configuration option (Step %1)
it: Imposta l'opzione di configurazione dell'importazione (Fase %1)

source: Check and Sort CSV Data (Step %1)
it: Verifica e ordina i dati CSV (Fase %1)

source: Review user account objects before LDAP import (Step %1)
it: Esaminare gli oggetti dell'account utente prima dell'importazione LDAP (Fase %1)

source: Continue here, when ready (this can take a while...)
it: Continua qui, quando sei pronto (questo può richiedere un po '...)

source: Import user account objects into LDAP (Step %1)
it: Importa oggetti account utente in LDAP (Fase %1)

source: Review group objects (Step %1)
it: Esamina gli oggetti del gruppo (Fase %1)

source: Import group objects into LDAP (Step %1)
it: Importare oggetti di gruppo in LDAP (Fase %1)

source: Review accounts' group memberships before LDAP import (Step %1)
it: Controlla l'appartenenza ai gruppi degli account prima dell'importazione LDAP (Fase %1)

source: Update accounts' group memberships in LDAP (Step %1)
it: Aggiorna l'appartenenza ai gruppi degli account in LDAP (Fase %1)

source: Some post-import clean-ups (Step %1)
it: Alcune pulizie post-importazione (Fase %1)

source: Finish LDAP import (Step %1)
it: Completata l'importazione LDAP (Fase %1)

source: Cancel Import
it: Annulla Importazione

source: Import Teachers
it: Importa Insegnanti

source: GOsa2 School Manager Module: Import Teachers
it: Modulo GOsa2 School Manager: Importa Insegnanti

source: SchoolManager subject group %s
it: Gruppo di soggetti SchoolManager %s

source: Administration Utility for Schools
it: Utility di Amministrazione per le Scuole

source: Import Students and Parents
it: Importa Studenti e Genitori

source: GOsa2 School Manager Module: Import Students and Parents
it: Modulo GOsa2 School Manager: Importa Studenti e Genitori

source: parent group of user %s %s
it: gruppo principale di utenti %s %s

source: Manage Accounts
it: Gestisci Account

source: GOsa2 School Manager super-class for managing accounts
it: GOsa2 School Manager super-classe per la gestione degli account

source: komma separated values
it: valori separati da virgola

source: semicolon separated values
it: valori separati da punto e virgola

source: tabstop separated values
it: valori separati da tabstop

source: blank separated values
it: valori separati bianchi

source: Permission error
it: Errore di autorizzazione

source: You've no permission to import user data!
it: Non hai il permesso di importare i dati dell'utente!

source: Error
it: Errore

source: Cannot read uploaded file: %s
it: Impossibile leggere il file caricato: %s

source: file not found
it: file non trovato

source: file is empty
it: il file è vuoto

source: file not readable
it: file non leggibile

source: File has an unsupported encoding!
it: Il file ha una codifica non supportata!

source: Cannot find CSV data in the selected file!
it: Impossibile trovare i dati CSV nel file selezionato!

source: Domain for new groups is empty!
it: Il dominio per i nuovi gruppi è vuoto!

source: The attribute %s is only allowed to select once!
it: L'attributo %s è permesso selezionarlo solo una volta!

source: male
it: maschio

source: female
it: femmina

source: Need at least %s and %s to create users (Check line %d in CSV file)!
it: È necessario almeno % se %s per creare utenti (controllare la riga %d nel file CSV)!

source: Class: %s
it: Classe: %s
