Repository: albanobattistella/gosa-plugin-schoolmanager
Catalog: locale/*.po
Languages: it

source: Import Students (only)
it: Importa Studenti (solo)

source: GOsa2 School Manager Module: Import Students (only)
it: Modulo GOsa2 School Manager: Importa studenti (solo)

source: SchoolManager class group %s
it: Gruppo di classi SchoolManager %s

source: SchoolManager course group %s
it: Gruppo di corsi SchoolManager %s

source: Archive Accounts
it: Archivio Accounts

source: GOsa2 School Manager Module: Archive Accounts
it: Modulo GOsa2 School Manager: Archivio Account

source: Step 3:
it: Fase 3:

source: Statistics
it: Statistiche

source: The clean-up process of SchoolManager-managed groups has been complete successfully, now. SchoolManager is ready for importing a new school year, now.
it: Il processo di pulizia dei gruppi gestiti da SchoolManager è stato completato con successo. SchoolManager ora, è pronto per importare un nuovo anno scolastico.

source: Emptied class groups: %1, already empty: %2
it: Gruppi classi svuotati: %1, già vuoto: %2

source: Emptied course groups: %1, already empty: %2
it: Gruppi di corsi svuotati: %1, già vuoto: %2

source: Emptied subject groups: %1, already empty: %2
it: Gruppi di soggetti svuotati: %1, già vuoto: %2

source: Emptied parent groups: %1, already empty: %2
it: Gruppi genitore svuotati: %1, già vuoto: %2

source: Some groups were found in the SchoolManager area (OU) that should be moved out of there, please introspect manually. Let this be done by someone with LDAP expertise.
it: Alcuni gruppi sono stati trovati nell'area di School Manager (OU) che dovrebbe essere spostata da lì, per favore introspeziona manualmente. Lascia che sia fatto da qualcuno con esperienza LDAP.

source: Ignored POSIX groups: %1, already empty: %2
it: Gruppi POSIX ignorati: %1, già vuoto: %2

source: Ignored object groups: %1, already empty: %2
it: Gruppi di oggetti ignorati: %1, già vuoto: %2

source: You can continue with importing teacher accounts now. You can use the &quot;Import Teachers&quot; SchoolManager module for this.
it: Puoi continuare con l'importazione degli account degli insegnanti ora. Puoi utilizzare "& Importa insegnanti" & quot; Modulo SchoolManager per questo.

source: Step 1:
it: Fase 1:

source: Empty SchoolManager administered standard (POSIX) groups
it: Gruppi scolastici vuoti amministrati (POSIX)

source: The following list shows all POSIX groups (classes, courses and teachers' subjects) managed by SchoolManager. You are about to empty all listed groups, i.e.: drop all members from those groups.
it: Il seguente elenco mostra tutti i gruppi POSIX (classi, corsi e materie degli insegnanti) gestiti da SchoolManager. Stai per svuotare tutti i gruppi elencati, vale a dire eliminare tutti i membri da quei gruppi.

source: With the next import of teachers or students, many of these groups will get automatically re-populated with members. If you are at the beginning of a new school year, you want to do this!
it: Con la successiva importazione di insegnanti o studenti, molti di questi gruppi verranno automaticamente ripopolati con membri. Se si è all'inizio di un nuovo anno scolastico, si vuole fare questo!

source: Flush all members from the listed course, class and subject (POSIX) groups now? After you have clicked this button, the process cannot be reverted!. Emptying all groups may take some time, so please be patient while waiting...
it: Svuota ora tutti i membri dai gruppi di corso, classe e soggetto (POSIX) elencati? Dopo aver fatto clic su questo pulsante, il processo non può essere ripristinato !. Lo svuotamento di tutti i gruppi potrebbe richiedere del tempo, quindi per favore sii paziente mentre aspetti ...

source: Really empty all POSIX groups listed below, now!
it: svuota davvero tutti i gruppi POSIX elencati qui sotto, ora!

source: POSIX Group: %1
it: Gruppo POSIX: %1

source: Group Name
it: Nome Gruppo

source: Description
it: Descrizione

source: Members (to be removed)
it: Membri (da rimuovere)

source: (none)
it: (nessuno)

source: Step 2:
it: Fase 2:

source: Empty SchoolManager administered object groups
it: Gruppi di oggetti amministrati da SchoolManager vuoti

source: The following list shows all parent groups managed by SchoolManager. You are about to empty all listed groups, i.e.: drop all members from those groups.
it: Il seguente elenco mostra tutti i gruppi principali gestiti da SchoolManager. Stai per svuotare tutti i gruppi elencati, vale a dire eliminare tutti i membri da quei gruppi.

source: With the next import of students (and their parents), many of these parent groups will get automatically re-populated with members. At the beginning of a new school year, you want to do this!
it: Con la successiva importazione di studenti (e dei loro genitori), molti di questi gruppi di genitori verranno automaticamente ri-compilati con i membri. All'inizio di un nuovo anno scolastico, si vuole fare questo!

source: Flush all members from the listed parent (object) groups now? After you have clicked this button, the process cannot be reverted! Emptying all groups may take some time, so please be patient while waiting...
it: Elimina tutti i membri dai gruppi genitori (oggetti) elencati ora? Dopo aver fatto clic su questo pulsante, il processo non può essere ripristinato! Lo svuotamento di tutti i gruppi potrebbe richiedere del tempo, quindi per favore sii paziente mentre aspetti...

source: Really empty all parent (object) groups listed below, now!
it: Svuota veramente tutti i gruppi genitori (oggetto) elencati qui sotto, ora!

source: Group object: %1
it: Oggetto di gruppo:% 1

source: Introduction
it: Introduzione:

source: GOsa2 School Manager Module: Introduction
it: Modulo GOsa2 School Manager: Introduzione

source: GOsa2 School Manager's <b>Archive Old Accounts</b> has not been implemented, yet.
it: GOsa2 School Manager's <b>Archivio Vecchi Account</b> non è ancora stato implementato.

source: Introduction to GOsa2's School Manager Add-On
it: Introduzione al componente aggiuntivo School Manager di GOsa2

source: General Information
it: Informazioni Generali

source: The SchoolManager Add-On for GOsa2 has been designed as an advanced LDAP import tool for user and group management at schools. In our experience, schools have several special needs uncommon to other IT setups, e.g.:
it: L'add-on SchoolManager per GOsa2 è stato progettato come strumento di importazione LDAP avanzato per la gestione di utenti e gruppi nelle scuole. Nella nostra esperienza, le scuole hanno diverse esigenze particolari non comuni ad altre configurazioni IT, ad esempio:

source: Many users come and go every year.
it: Molti utenti vanno e vengono ogni anno.

source: Group memberships may change every half year.
it: Le iscrizioni ai gruppi possono cambiare ogni semestre.

source: Each student comes with parents that are also involved in school IT (e.g., home page login).
it: Ogni studente arriva con i genitori che sono anche coinvolti nella scuola IT (ad es., Login alla home page).

source: With this SchoolManager Add-On you can mass create user accounts for teachers, students and parents via importing two (large) CSV files. Most school offices run school administration tools, that can provide such CSV files as required by GOsa2's SchoolManager Add-On.
it: Con questo add-on di SchoolManager è possibile creare masse di account utente per insegnanti, studenti e genitori tramite l'importazione di due (grandi) file CSV. La maggior parte degli uffici scolastici esegue strumenti di amministrazione della scuola, che possono fornire tali file CSV come richiesto dal componente aggiuntivo SchoolManager di GOsa2.

source: From the CSV file, various information gets extracted:
it: Dal file CSV, vengono estratte varie informazioni:

source: Personal data (name, date of birth, unique ID) as stored in the school administration software
it: Dati personali (nome, data di nascita, ID univoco) memorizzati nel software di amministrazione della scuola

source: Teachers: class teacher, taught subjects, taught courses
it: Insegnanti: insegnante di classe, materie di insegnamento, corsi tenuti

source: Students: each student normally comes with one or two parents that also may need accounts in LDAP
it: Studenti: ogni studente viene normalmente con uno o due genitori che potrebbero aver bisogno di account in LDAP

source: Students and teachers are grouped by classes and courses
it: Studenti e insegnanti sono raggruppati per classi e corsi

source: Students and their parents are bound together via parent groups
it: Gli studenti ei loro genitori sono legati insieme tramite gruppi di genitori

source: Mail addresses of teachers, students and parents.
it: Indirizzi postali di insegnanti, studenti e genitori.

source: SchoolManager is idempotent
it: School Manager è idempotente

source: The import algorithm in SchoolManager is idempotent. This means you can import the same CSV file several times without endangering already existing accounts. If some of the information in the CSV file has changed, the correlating LDAP objects (users/groups) will be adapted.
it: L'algoritmo di importazione in SchoolManager è idempotente. Ciò significa che è possibile importare più volte lo stesso file CSV senza mettere in pericolo account già esistenti. Se alcune delle informazioni nel file CSV sono state modificate, gli oggetti LDAP correlati (utenti / gruppi) verranno adattati.

source: Nothing Gets Deleted...
it: Nulla viene eliminato ...

source: In SchoolManager, there is this concept of not deleting any LDAP information, ever.
it: In SchoolManager, c'è questo concetto di non eliminare alcuna informazione LDAP, mai.

source: POSIX (UniX) user accounts and POSIX groups always have their representation on the servers' file system level. Files and folders in home and group directories are owned by a specific user and a specific group. Technically, the mapping between users/groups and file system permissions happens through numbers: UID number, GID number.
it: Gli account utente POSIX (UniX) e i gruppi POSIX hanno sempre la loro rappresentazione a livello di file system dei server. I file e le cartelle nelle directory home e di gruppo sono di proprietà di un utente specifico e di un gruppo specifico. Tecnicamente, la mappatura tra utenti / gruppi e permessi del file system avviene attraverso numeri: numero UID, numero GID.

source: If accounts / groups get removed from LDAP, it may occur that UID numbers and GID numbers of removed users and groups get re-used for new LDAP user accounts or LDAP groups. This might lead to unwanted access to data on the file system level. The new user can potentially access files created by the removed user who formerly owned the new user's UID number. Same, in theory, applies for groups and GID numbers.
it: Se account / gruppi vengono rimossi da LDAP, è possibile che numeri UID e numeri GID di utenti e gruppi rimossi vengano riutilizzati per nuovi account utente LDAP o gruppi LDAP. Ciò potrebbe comportare un accesso indesiderato ai dati a livello di file system. Il nuovo utente può potenzialmente accedere ai file creati dall'utente rimosso che precedentemente possedeva il numero UID del nuovo utente. Lo stesso, in teoria, vale per gruppi e numeri GID.

source: SchoolManager's solution to this is: keep all user and group objects in LDAP forever. User objects (i.e. their user ID) can be renamed with the &quot;Archive Accounts&quot; module, so that nice and short user IDs stay available on your school site.
it: La soluzione di SchoolManager è: mantenere tutti gli oggetti utente e di gruppo in LDAP per sempre. Gli oggetti utente (ovvero il loro ID utente) possono essere rinominati con & quot; Modulo archivio & quot; Account, in modo che gli ID utente belli e corti siano disponibili sul sito della tua scuola.

source: First time usage
it: Primo utilizzo

source: If you are using the SchoolManager Add-On for GOsa2 for the first time, please follow these steps:
it: Se utilizzi il componente aggiuntivo GOsa2 in SchoolManager per la prima volta, procedi nel seguente modo:

source: First, finish up reading all information provided by this introduction.
it: Per prima cosa, finisci di leggere tutte le informazioni fornite da questa introduzione.

source: Then, change to the Directory Structure Management view of GOsa2.
it: Quindi, passare alla visualizzazione Gestione struttura directory di GOsa2.

source: Create a GOsa2 Department with the name &quot;SchoolManager&quot; at a location of your choice within the LDAP tree.
it: Crea un reparto GOsa2 con il nome & quot; SchoolManager & quot; in una posizione a scelta all'interno dell'albero LDAP.

source: Return to the SchoolManager Add-On again and start importing students and/or teachers. When switching to the &quot;Student Management&quot; or the &quot;Teacher Management&quot; tabs, you will find more information on the requirements regarding the CSV import files. Our recommendation is: start with importing the teacher accounts.
it: Ritornare di nuovo al componente aggiuntivo SchoolManager e avviare l'importazione di studenti e / o insegnanti. Quando si passa a & quot; Gestione studenti & quot; oppure "Gestione insegnanti" di & quot; schede, troverai maggiori informazioni sui requisiti relativi ai file di importazione CSV. La nostra raccomandazione è: iniziare con l'importazione degli account degli insegnanti.

source: Preparing a new School Year
it: Preparare un nuovo anno scolastico

source: SchoolManager creates various groups (POSIX groups, LDAP DN groups) on user import. These groups get stored at a special location of the LDAP tree.
it: SchoolManager crea vari gruppi (gruppi POSIX, gruppi DN LDAP) sull'importazione dell'utente. Questi gruppi vengono memorizzati in una posizione speciale dell'albero LDAP.

source: With the start of a new school year, we recommend flushing all members from these groups, i.e. class, course, subject and parent groups. After that, continue with importing all teachers first, and then proceed with the student imports.
it: Con l'inizio di un nuovo anno scolastico, consigliamo di svuotare tutti i membri da questi gruppi, ad esempio classe, corso, soggetto e gruppi principali. Dopodiché, continua con l'importazione di tutti gli insegnanti, quindi procedi con le importazioni degli studenti.

source: OU container for groups managed by SchoolManager:
it: Contenitore OU per gruppi gestiti da SchoolManager:

source: Flush all members from course, class, subject and parent groups now? If you click this button, SchoolManager presents to you a list of to be emptied groups and asks for confirmation before actually performing this clean-up task.
it: Svuotare tutti i membri di corso, classe, soggetto e gruppi genitori ora? Se si fa clic su questo pulsante, SchoolManager presenta un elenco di gruppi da svuotare e richiede conferma prima di eseguire effettivamente questa operazione di pulizia.

source: Empty all SchoolManager groups now!
it: Svuota ora tutti i gruppi di SchoolManager!

source: Updating User Information During the Term
it: Aggiornamento delle informazioni dell'utente durante il termine

source: In the middle of a school year, you can easily update student, teacher and partent accounts, by importing a subset of the complete CSV file. Simply import the data of students and/or teachers that require being updated or added.
it: Nel mezzo di un anno scolastico, puoi facilmente aggiornare gli account di studenti, insegnanti e genitori, importando un sottoinsieme del file CSV completo. Basta importare i dati di studenti e/o insegnanti che richiedono di essere aggiornati o aggiunti.

source: You can, of course, also upload the complete data set, but this will take far too long, if only some account information have changed (e.g. new parent email address).
it: Naturalmente, puoi anche caricare il set di dati completo, ma ciò richiederà troppo tempo, se solo alcune informazioni sull'account sono cambiate (ad es. Il nuovo indirizzo email principale).

source: Localization and Regional Adaptations
it: Localizzazione e Adattamenti Regionali

source: The SchoolManager add-on for GOsa2 has been developed with the German school system in mind, more specifically the school system as found in the Nothern German county Schleswig-Holstein.
it: Il componente aggiuntivo SchoolManager per GOsa2 è stato sviluppato pensando al sistema scolastico tedesco, in particolare al sistema scolastico presente nella contea tedesca dello Schleswig-Holstein.

source: If you intend using SchoolManager on your GOsa2 site but find that it does not at all fill you needs, this may be due to regional differences in how schools get administered all over the world. Don't give up, SchoolManager can be adapted/extended to your needs.
it: Se intendi usare SchoolManager sul tuo sito GOsa2 ma scopri che non soddisfa affatto le tue esigenze, ciò potrebbe essere dovuto a differenze regionali nel modo in cui le scuole vengono amministrate in tutto il mondo. Non arrenderti, SchoolManager può essere adattato/esteso alle tue esigenze.

source: Please get in touch with the GOsa2 developers on Github and we will see, what we can do for you:
it: Per favore teniamoci in contatto con gli sviluppatori GOsa2 su Github e vedremo cosa possiamo fare per te:

source: With GOsa2 School Manager's <b>Import Students and Parents Module</b> you can import student user accounts, parent accounts, class groups and course groups from a single CSV file containing one user's account information per line.
it: With GOsa2 School Manager's <b>Import Importa modulo Studenti e genitori</b> puoi importare account utente studente, account genitore, gruppi di classi e gruppi di corsi da un singolo file CSV contenente le informazioni sull'account di un utente per riga.

source: With GOsa2 School Manager's <b>Import Teachers Module</b> you can import teacher user accounts, class groups, course groups and subject groups from a single CSV file containing one user's account information per line.
it: With GOsa2 School Manager's <b>Importa Modulo Insegnanti</b> puoi importare account utente insegnante, gruppi di classi, gruppi di corsi e gruppi di soggetti da un singolo file CSV contenente le informazioni sull'account di un utente per riga.

source: With GOsa2 School Manager's <b>Import Students (only) Module</b> you can import student user accounts, class groups and course groups from a single CSV file containing one user's account information per line.
it: With GOsa2 School Manager's <b>Import Importa studenti (solo)</b> puoi importare account utente studenti, gruppi di classi e gruppi di corsi da un singolo file CSV contenente le informazioni sull'account di un utente per riga.

source: STEP %1: Upload CSV File
it: FASE 1%: Carica file CSV

source: The data provided via the uploadable CSV file needs to be of the following data format:
it: I dati forniti tramite il file CSV caricabile devono essere del seguente formato di dati:

source: Column
it: Colonna

source: Number
it: Numero

source: This is useful for discussing issues with CSV import files, but the number column is normally not used.
it: Questo è utile per discutere problemi con i file di importazione CSV, ma la colonna numerica normalmente non viene utilizzata.

source: The user account's login ID. If left empty, it will be attempted to auto-generated a login ID.
it: L'ID di accesso dell'account utente. Se lasciato vuoto, verrà tentato di generare automaticamente un ID di accesso.

source: The user's password. If left empty, a password will be generated during the import.
it: La password dell'utente. Se lasciato vuoto, verrà generata una password durante l'importazione.

source: Student ID
it: ID Studente

source: An unequivocal number that a student is associated with in the school's administration software.
it: Un numero inequivocabile a cui uno studente è associato nel software di amministrazione della scuola.

source: Last Name(s)
it: Cognome(i)

source: The student's last name(s).
it: Il cognome(i) dello studente.

source: First Name(s)
it: Nome(i)

source: The student's first and middle name(s).
it: Il nome e il secondo nome dello studente(i)

source: Date of Birth
it: Data di nascita

source: The student's date of birth. This field is an obligatory field as it is used to distinguish accounts with identical first and last names.
it: La data di nascita dello studente. Questo campo è un campo obbligatorio in quanto viene utilizzato per distinguere accounts con nome e cognome identici.

source: Gender
it: Sesso

source: The student's gender (male / female / ...).
it: Sesso dello studente (maschio / femmina / ...).

source: Class
it: Classe

source: The class name / identifier.
it: Il nome della classe / identificatore.

source: Last Name (Parent 1)
it: Cognome (Genitore 1)

source: Last name of parent 1 (e.g. mother).
it: Cognome del genitore 1 (ad es. Madre).

source: First Name (Parent 1)
it: Nome (Genitore 1)

source: First (and middle) name(s) of parent 1.
it: Primo (e soprannome) nome (i) di genitore 1.

source: Mail Address (Parent 1)
it: Indirizzo di posta (genitore 1)

source: Mail address of parent 1.
it: Indirizzo di posta del genitore 1.

source: Last Name (Parent 2)
it: Cognome (Genitore 2)

source: Last name of parent 2 (e.g. father).
it: Cognome del genitore 2 (ad es. Padre).

source: First Name (Parent 2)
it: Nome (Genitore 2)

source: First (and middle) name(s) of parent 2.
it: Primo (e secondo) nome (i) di genitore 2.

source: Mail Address (Parent 2)
it: Indirizzo di posta (Padre 2)

source: Mail address of parent 2.
it: Indirizzo di posta del genitore 2.

source: Courses
it: Corsi

source: Courses a student is signed up for (one per column, use as many columns as needed).
it: Corsi a cui uno studente è iscritto (uno per colonna, usa tutte le colonne necessarie).

source: This is useful for manual discussing issues with CSV import files, but the number column is normally not used.
it: Questo è utile per la discussione manuale dei problemi con i file di importazione CSV, ma normalmente la colonna del numero non viene utilizzata.

source: Last Name
it: Cognome

source: The teacher's last name(s).
it: Il cognome (i) dell'insegnante.

source: First Name
it: Nome

source: The teacher's first (and middle) name(s).
it: Il nome (i) del primo insegnante.

source: The teachers's date of birth. This field is an obligatory field as it is used to distinguish accounts with identical first and last names.
it: La data di nascita degli insegnanti. Questo campo è un campo obbligatorio in quanto viene utilizzato per distinguere gli accounts con nome e cognome identici.

source: Subjects
it: Soggetti

source: The subjects a teacher can teach / is trained for.
it: Le materie per cui un insegnante può insegnare / è addestrato.

source: The primary class a teacher is assigned to. If the teacher is not a class teacher, then leave empty.
it: La classe primaria a cui è assegnato un insegnante. Se l'insegnante non è un insegnante di classe, lascia vuoto.

source: Courses a teacher teaches (one per column, use as many columns as needed).
it: I corsi tenuti da un insegnante (uno per colonna, utilizzano tutte le colonne necessarie).

source: Upload CSV File
it: Carica file CSV

source: Select CSV file with students' and their parents' data to import:
it: Seleziona il file CSV con i dati degli studenti e dei genitori da importare:

source: Select CSV file with teachers' data to import:
it: Seleziona il file CSV con i dati degli insegnanti da importare:

source: Select CSV file with students' data to import:
it: Seleziona il file CSV con i dati degli studenti da importare:

source: Browse
it: Sfoglia

source: CSV format options:
it: Opzioni di formato CSV:

source: First line in CSV file contains column headers (so ignore that first line):
it: La prima riga nel file CSV contiene le intestazioni delle colonne (quindi ignora quella prima riga):
